math441/notes.org
#+LaTeX_HEADER: \usepackage{header}

Diff Eq Notes

* Initial Definitions
  - Definition:
    - DE is an equation that describes the properties of an unkown
    function(s)

  - Ordinary DE:
    - describes functions of 1 variable

  - Partial DE:
    - describes multivariable functions

  - Notation:
    - independent variable: y
    - dependent variable: t
* Operator Notation
  Definition:
  $\frac{d^n}{dt^n} = D^n \rightarrow f^{(n)} = D^n(f)$
* Stability
** Definition
   1) Stability $\equiv$ a system in which long term behvaior does not
      depend within some variation on initial conditions
   2) For Linear D.E. y is Stable iff:
    \begin{equation}
    \lim_{t\rightarrow \infty} y_h = 0 \pm \epsilon
    \end{equation}
   3) For S.O.L.E
      1) Stable iff either of the equivalent statments is true:
	 1) $Re(r) < 0$
	 2) $a,b,c >0$ or $a,b,c <0$
* Initial Value Problems
  \begin{equation}
  IVP = \left \{
  \begin{array}{lr}
  DE\\
  y = C_1\\
  \vdots\\
  y^{(n)} = C_n
  \end{array}
  \right.
  \end{equation}
 
* Seperable DE
** Definition   
*** Form
    \begin{equation}
    \d{y}{t}=f(y)g(t)
    \end{equation}
*** Solution
    1) Let DE be $\d{y}{t}=f(y)g(t)$
    2) Seperating terms: $\frac{dt}{f(y)}\d{y}{t}=\frac{dt}{f(y)}f(y)g(t) \implies \frac{dy}{f(y)}=g(t)dt$
       1) If $f(y)^{-1}$ is not defined from some t, solve outside of
	  that range and consider those t separately
    3) Integrate both sides: $\int \frac{dy}{f(y)}=\int g(t)dt$
    4) If possible solve for $y(t)$
* Homogenous Equations
** Form
   \begin{equation}
   \d{y}{t}=f(\frac{y}{t})
   \end{equation}
** Technique for Solving:
   1) Let $v=\frac{y}{t} \implies y=vt$
   2) Change of variable: $y'=v't+v \implies v't+v=f(v)$
   3) Moving $v$ to left side: $t\d{v}{t}=f(v)-v = g(v)$
   4) Seperating: $\frac{dv}{g(v)}=\frac{dt}{t}$
   5) Solve using Seperable D.E. techniques
* Exact Equations
** Form
   \begin{equation}
   \pd{}{t}\Psi(f(t),y(t)) = \pd{\Psi}{f}\d{f}{t} + \pd{\Psi}{y}\d{y}{t}
   \end{equation}
** Technique for Solving:
   1) Suppose DE is of the form: $M(x,y) + N(x,y) y_x = 0$
   2) If M_y = N_x, then DE is an Exact Eq, solve for $\Psi(x,y) = \Psi( f(x), y(x))$
* Autonomous Equations
** Form
   \begin{equation}
   y'=f(y)
   \end{equation}
** Anaylsis
*** Differentiation Fields
* Linear Diff Equations
  Definition: For an operator,L, the DE: L(y) = 0 is linear iff:
  - L(y_1+y_1) = L(y_1)+L(y_2)
  - L(cy) = cL(y)

** First Order Linear Eq
*** Form
    \begin{equation}
    y' + p(t)y = f(t)
    \end{equation}
*** Solving using Integration Factors
    1) Let \mu be a mult factor s.t. $\mu y' + \mu'y=g(t) \implies [\mu(t) y(t)]'= g(t)$
    2) Thus $\mu'=\mu p(t) \implies \frac{d\mu}{\mu}=p(t)dt \implies
       \mu = e^{\int p(t)dt }$
    3) Therfore
       \begin{equation}
       y(t)e^{\int p(t)dt}=\int g(t)dt
       \end{equation} $\square$
*** Bernoulli's equations
**** Form
     \begin{equation}
     y'+p(t)y=q(t)y^n, n\in \mathbb{Z}
     \end{equation}
**** Solution
     1) Let $v=y^{2-n} \implies v'=(1-n)y^{-n}y'$
     2) Thus $y'=\frac{v'}{1-n}$ and $y = y^n v$
     3) Subsituting in Bernoulli equation: $\frac{v'}{1-n}y^n+p(t)y^nv=q(t)y^n$
     4) Moving into standard form: 
       	\begin{equation}
       	v'+(1-n)p(t)v=(1-n)q(t)
       	\end{equation}
     5) Solve using Integration Factors $\square$
*** Picard Iteration
**** Integral Equations
     Suppose $f$ is continous, then a function $y=\Phi(t)$
     solves the IVP iff $y=\Phi(t)$ solves the corresponding integral equation:
     \begin{equation}
     y(t)=y_0+\int_{t_0}^t f(s,y(s))ds
     \end{equation}
**** Idea
     1) Let $f(t) = \d{y}{t}$
     1) Construct a sequence of functions $\{g_n(t) : n \geq 0, n\in \mathbb{Z}\}$ that converges to soln:
       	1) $y_0(t) = y_0$
       	3) $y_{n+1}(t)=y_0+ \int_{t_0}^tf(s,y_n(t))ds$
*** Lipsichitz Condition
    1) For $f(t,y) \in \mathbb{R}$, f is Lipsichitz iff $\exists L\in \mathbb{R}$:
       \begin{equation}
       \abs{f(t_1,y_1)-f(t_2,y_2)} \leq L\cdot \abs{(y_1-y_2)}
       \end{equation}
    2) If $\Delta y \neq 0$ then this can be thought of as:
       \begin{equation}
       \abs{\frac{\Delta f}{\Delta y}} \leq L
       \end{equation}
    3) _Lemma_: if $f_y$ is bounded then f is Lipsichitz
*** Uniform Convergence (U.C.)
**** Definition:
     A sequence of functions $\{f_n(t) : n\geq 0 ; n\in\mathbb{Z}\}$
     defined on the inverval $I$ _uniformially converges_ to $f(t)$ iff
     $\forall t > 0, \exists N\in \mathbb{Z}$ s.t. $\abs{f_n(t)-f(t)}
     < \epsilon$ everywhere on I $\forall n > N$
**** 
     _Theorem_: Given $\f_n(t)$ is continuous on I, if
     $\lim_{n\rightarrow \infty}{f_n(t)} \rightarrow f(t)$ with U.C, then:
       	1. $f$ is continuous
       	2. If $f_n$ is differtiable, then $f$ is differtiable and $f'_n$
           U.C. to $f'$
       	3. The limit is communitive with respect to integration
	  \begin{equation}
	  \lim_{n\rightarrow \infty}\int_I f_n(t)dt = \int_I \lim_{n\rightarrow \infty} f_n(t) dt
	  \end{equation}
**** Weirstress M Test
     _Theorem_: 
     - If $\forall n \in I, \abs{f_n(t)} \leq M_n$ and if $\sum_{n=0}^\infty M_n< L$ for some $L\in \mathbb{R}$, 
     - Then $\sum_{n=0}^\infty f_n(t)$ Converges Uniformially on I
*** Existence Theorem
    1. _Claim_: 
       1. If:
	  1. $f(y)$ is continous
	  2. $f$ is Lipsichitz w.r.t. $y \in R\equiv \{\(t,y) :
             \abs{t-t_0}\leq T$ and $\abs{y-y_0} \leq k\}$
	  4. $\sum_{k=1}^\infty [y_k(t)-y_{k-1}(t)]$ converges uniformially
       2. Then: $\exists$ a solution to the IVP on the interval
          $\abs{t-t_0}\leq T_1=min(T,\frac{k}{m})$ where $\abs{f(t,y)} \leq M\in R$
    2. _Proof_:
       1. Converting the IVP to an I.E.: $y(t)=y_0+\int_{t_0}^t f(s,y(s))ds$
       2. Note theat: $\abs{y_k(t)-y_{k-1}(t)} \leq \frac{M}{L}
          \frac{L^n (t-t_0)^n}{n!} \leq \frac{M}{L}\frac{L^n T_1^n}{n!}$
       3. Define: $M_n\equiv\sum_{k=1}^\infty\frac{M}{L}\frac{(L T_1)^n}{n!} = \frac{M}{L}(e^{LT_1}-1)$
       4. Apply the Weirstress M Test, because $\frac{M}{L}\frac{(L
          T_1)^n}{n!}$ converges, then $\sum_{k=1}^\infty[y_k-y_{k-1}]$ converges
       5. Thus the series $\{y_n : n \geq 1\}$ converges uniformially
          on the interval.
       6. Therefore $\exists$ a solution to the IVP $\square$
