math441/notes.tex
% Created 2012-05-05 Sat 18:03
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{header}

\title{Diff Eq Notes}
\author{}
\date{05 May 2012}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}


\section{Initial Definitions}
\label{sec-1}

\begin{itemize}
\item Definition:

\begin{itemize}
\item DE is an equation that describes the properties of an unkown
\end{itemize}

\item Ordinary DE:

\begin{itemize}
\item describes functions of 1 variable
\end{itemize}

\item Partial DE:

\begin{itemize}
\item describes multivariable functions
\end{itemize}

\item Notation:

\begin{itemize}
\item independent variable: y
\item dependent variable: t
\end{itemize}

\end{itemize}
\section{Operator Notation}
\label{sec-2}

  Definition:
  $\frac{d^n}{dt^n} = D^n \rightarrow f^{(n)} = D^n(f)$
\section{Stability}
\label{sec-3}

\subsection{Definition}
\label{sec-3.1}

\begin{enumerate}
\item Stability $\equiv$ a system in which long term behvaior does not
      depend within some variation on initial conditions
\item For Linear D.E. y is Stable iff:
    \begin{equation}
    \lim_{t\rightarrow \infty} y_h = 0 \pm \epsilon
    \end{equation}
\item For S.O.L.E

\begin{enumerate}
\item Stable iff either of the equivalent statments is true:

\begin{enumerate}
\item $Re(r) < 0$
\item $a,b,c >0$ or $a,b,c <0$
\end{enumerate}

\end{enumerate}

\end{enumerate}
\section{Initial Value Problems}
\label{sec-4}

  \begin{equation}
  IVP = \left \{
  \begin{array}{lr}
  DE\\
  y = C_1\\
  \vdots\\
  y^{(n)} = C_n
  \end{array}
  \right.
  \end{equation}
 
\section{Seperable DE}
\label{sec-5}

\subsection{Definition}
\label{sec-5.1}

\subsubsection{Form}
\label{sec-5.1.1}

    \begin{equation}
    \d{y}{t}=f(y)g(t)
    \end{equation}
\subsubsection{Solution}
\label{sec-5.1.2}

\begin{enumerate}
\item Let DE be $\d{y}{t}=f(y)g(t)$
\item Seperating terms: $\frac{dt}{f(y)}\d{y}{t}=\frac{dt}{f(y)}f(y)g(t) \implies \frac{dy}{f(y)}=g(t)dt$

\begin{enumerate}
\item If $f(y)^{-1}$ is not defined from some t, solve outside of
          that range and consider those t separately
\end{enumerate}

\item Integrate both sides: $\int \frac{dy}{f(y)}=\int g(t)dt$
\item If possible solve for $y(t)$
\end{enumerate}
\section{Homogenous Equations}
\label{sec-6}

\subsection{Form}
\label{sec-6.1}

   \begin{equation}
   \d{y}{t}=f(\frac{y}{t})
   \end{equation}
\subsection{Technique for Solving:}
\label{sec-6.2}

\begin{enumerate}
\item Let $v=\frac{y}{t} \implies y=vt$
\item Change of variable: $y'=v't+v \implies v't+v=f(v)$
\item Moving $v$ to left side: $t\d{v}{t}=f(v)-v = g(v)$
\item Seperating: $\frac{dv}{g(v)}=\frac{dt}{t}$
\item Solve using Seperable D.E. techniques
\end{enumerate}
\section{Exact Equations}
\label{sec-7}

\subsection{Form}
\label{sec-7.1}

   \begin{equation}
   \pd{}{t}\Psi(f(t),y(t)) = \pd{\Psi}{f}\d{f}{t} + \pd{\Psi}{y}\d{y}{t}
   \end{equation}
\subsection{Technique for Solving:}
\label{sec-7.2}

\begin{enumerate}
\item Suppose DE is of the form: $M(x,y) + N(x,y) y_x = 0$
\item If M$_y$ = N$_x$, then DE is an Exact Eq, solve for $\Psi(x,y) = \Psi( f(x), y(x))$
\end{enumerate}
\section{Autonomous Equations}
\label{sec-8}

\subsection{Form}
\label{sec-8.1}

   \begin{equation}
   y'=f(y)
   \end{equation}
\subsection{Anaylsis}
\label{sec-8.2}

\subsubsection{Differentiation Fields}
\label{sec-8.2.1}

\section{Linear Diff Equations}
\label{sec-9}

  Definition: For an operator,L, the DE: L(y) = 0 is linear iff:
\begin{itemize}
\item L(y$_1$+y$_1$) = L(y$_1$)+L(y$_2$)
\item L(cy) = cL(y)
\end{itemize}
\subsection{First Order Linear Eq}
\label{sec-9.1}

\subsubsection{Form}
\label{sec-9.1.1}

    \begin{equation}
    y' + p(t)y = f(t)
    \end{equation}
\subsubsection{Solving using Integration Factors}
\label{sec-9.1.2}

\begin{enumerate}
\item Let $\mu$ be a mult factor s.t. $\mu y' + \mu'y=g(t) \implies [\mu(t) y(t)]'= g(t)$
\item Thus $\mu'=\mu p(t) \implies \frac{d\mu}{\mu}=p(t)dt \implies
       \mu = e^{\int p(t)dt }$
\item Therfore
       \begin{equation}
       y(t)e^{\int p(t)dt}=\int g(t)dt
       \end{equation} $\square$
\end{enumerate}
\subsubsection{Bernoulli's equations}
\label{sec-9.1.3}

\begin{itemize}

\item Form\\
\label{sec-9.1.3.1}

     \begin{equation}
     y'+p(t)y=q(t)y^n, n\in \mathbb{Z}
     \end{equation}

\item Solution\\
\label{sec-9.1.3.2}

\begin{enumerate}
\item Let $v=y^{2-n} \implies v'=(1-n)y^{-n}y'$
\item Thus $y'=\frac{v'}{1-n}$ and $y = y^n v$
\item Subsituting in Bernoulli equation: $\frac{v'}{1-n}y^n+p(t)y^nv=q(t)y^n$
\item Moving into standard form: 
        \begin{equation}
        v'+(1-n)p(t)v=(1-n)q(t)
        \end{equation}
\item Solve using Integration Factors $\square$
\end{enumerate}
\end{itemize} % ends low level
\subsubsection{Picard Iteration}
\label{sec-9.1.4}

\begin{itemize}

\item Integral Equations\\
\label{sec-9.1.4.1}

     Suppose $f$ is continous, then a function $y=\Phi(t)$
     solves the IVP iff $y=\Phi(t)$ solves the corresponding integral equation:
     \begin{equation}
     y(t)=y_0+\int_{t_0}^t f(s,y(s))ds
     \end{equation}

\item Idea\\
\label{sec-9.1.4.2}

\begin{enumerate}
\item Let $f(t) = \d{y}{t}$
\item Construct a sequence of functions $\{g_n(t) : n \geq 0, n\in \mathbb{Z}\}$ that converges to soln:

\begin{enumerate}
\item $y_0(t) = y_0$
\item $y_{n+1}(t)=y_0+ \int_{t_0}^tf(s,y_n(t))ds$
\end{enumerate}

\end{enumerate}
\end{itemize} % ends low level
\subsubsection{Lipsichitz Condition}
\label{sec-9.1.5}

\begin{enumerate}
\item For $f(t,y) \in \mathbb{R}$, f is Lipsichitz iff $\exists L\in \mathbb{R}$:
       \begin{equation}
       \abs{f(t_1,y_1)-f(t_2,y_2)} \leq L\cdot \abs{(y_1-y_2)}
       \end{equation}
\item If $\Delta y \neq 0$ then this can be thought of as:
       \begin{equation}
       \abs{\frac{\Delta f}{\Delta y}} \leq L
       \end{equation}
\item \underline{Lemma}: if $f_y$ is bounded then f is Lipsichitz
\end{enumerate}
\subsubsection{Uniform Convergence (U.C.)}
\label{sec-9.1.6}

\begin{itemize}

\item Definition:\\
\label{sec-9.1.6.1}

     A sequence of functions $\{f_n(t) : n\geq 0 ; n\in\mathbb{Z}\}$
     defined on the inverval $I$ \underline{uniformially converges} to $f(t)$ iff
     $\forall t > 0, \exists N\in \mathbb{Z}$ s.t. $\abs{f_n(t)-f(t)}
     < \epsilon$ everywhere on I $\forall n > N$

\item \\


     \underline{Theorem}: Given $\f_n(t)$ is continuous on I, if
     $\lim_{n\rightarrow \infty}{f_n(t)} \rightarrow f(t)$ with U.C, then:
\begin{enumerate}
\item $f$ is continuous
\item If $f_n$ is differtiable, then $f$ is differtiable and $f'_n$
           U.C. to $f'$
\item The limit is communitive with respect to integration
          \begin{equation}
          \lim_{n\rightarrow \infty}\int_I f_n(t)dt = \int_I \lim_{n\rightarrow \infty} f_n(t) dt
          \end{equation}
\end{enumerate}

\item Weirstress M Test\\
\label{sec-9.1.6.3}

     \underline{Theorem}: 
\begin{itemize}
\item If $\forall n \in I, \abs{f_n(t)} \leq M_n$ and if $\sum_{n=0}^\infty M_n< L$ for some $L\in \mathbb{R}$,
\item Then $\sum_{n=0}^\infty f_n(t)$ Converges Uniformially on I
\end{itemize}
\end{itemize} % ends low level
\subsubsection{Existence Theorem}
\label{sec-9.1.7}

\begin{enumerate}
\item \underline{Claim}:

\begin{enumerate}
\item If:

\begin{enumerate}
\item $f(y)$ is continous
\item $f$ is Lipsichitz w.r.t. $y \in R\equiv \{\(t,y) :
             \abs{t-t_0}\leq T$ and $\abs{y-y_0} \leq k\}$
\item $\sum_{k=1}^\infty [y_k(t)-y_{k-1}(t)]$ converges uniformially
\end{enumerate}

\item Then: $\exists$ a solution to the IVP on the interval
          $\abs{t-t_0}\leq T_1=min(T,\frac{k}{m})$ where $\abs{f(t,y)} \leq M\in R$
\end{enumerate}

\item \underline{Proof}:

\begin{enumerate}
\item Converting the IVP to an I.E.: $y(t)=y_0+\int_{t_0}^t f(s,y(s))ds$
\item Note theat: $\abs{y_k(t)-y_{k-1}(t)} \leq \frac{M}{L}
          \frac{L^n (t-t_0)^n}{n!} \leq \frac{M}{L}\frac{L^n T_1^n}{n!}$
\item Define: $M_n\equiv\sum_{k=1}^\infty\frac{M}{L}\frac{(L T_1)^n}{n!} = \frac{M}{L}(e^{LT_1}-1)$
\item Apply the Weirstress M Test, because $\frac{M}{L}\frac{(L
          T_1)^n}{n!}$ converges, then $\sum_{k=1}^\infty[y_k-y_{k-1}]$ converges
\item Thus the series $\{y_n : n \geq 1\}$ converges uniformially
          on the interval.
\item Therefore $\exists$ a solution to the IVP $\square$
\end{enumerate}

\end{enumerate}
