math441/notes.org
*** Uniqueness Theorm
    1. _Claim_: 
       1. If $\Phi(t)$ and $\Psi(t)$ are solutions of $y'\equiv
	  f(y,t) \in R$ and if $f$ is Lipseitz w.r.t. $y\in R$
       2. Then $\abs{\Phi(t) - Psi(t)} \leq e^{L\abs{t-t_0}}
          \abs{\Phi(t_0) - \Psi(t_0)} = 0$
	  1. Because they solve the same I.V.P. $\abs{\Phi(t_0) -
             \Psi(t_0)} = 0$
       3. Equivalently: Then $\Psi(t) = \Psi(t)$
    2. _Proof_:
       1. $E\equiv \abs{\Phi(t)-\Psi(t)}^2$
	  1. Note that $E\geq 0$
       2. $\d{}{t}E=2(\Phi(t)-\Psi(t))(\Phi'(t)-\Psi'(t))$
       3. $E'\stackrel{DE}{=}2(\Phi(t)-\Psi(t))(f(t,\Phi)-f(t,\Psi))$
       4. $E'\stackrel{Lip}{\leq} 2\abs{\Phi(t)-\Psi(t)}L\abs{\Phi(t)-\Psi(t)}$
       5. Thus $E' \leq 2LE \implies E'-2LE \leq 0\implies (E(t) e^{-2Lt})' \leq 0$
	  1. Note that E' is stricly decreasing
       6. Therefore: $e^{-t}E(t)\leq e^{2Lt_0} E(t_0) \implies
          E(t)\leq e^{2L(t-t_0)}E(t_0)$
       7. Substituting: $\abs{\Phi(t)-\Psi(t)}^2 \leq e^{2L(t-t_0)} \abs{\Phi(t_0)-\Psi(t_0)}^2$
       8. Because of absolute value: $\abs{\Phi(t)-\Psi(t)} \leq e^{2L(t-t_0)} \abs{\Phi(t_0)-\Psi(t_0)}$
       9. Because they solve the same I.V.P. $\abs{\Phi(t_0) -
          \Psi(t_0)} = 0$
       10. Thus $\Phi(t)=\Psi(t) \square$
** Second Order Linear Eq
*** The Wronskian:
\begin{equation}
W(f,g)(t) = \left |
\begin{array}{cccc}
	 f_1(x) & f_2(x) & \cdots & f_n(x) \\
	 f_1'(x) & f_2'(x) & \cdots & f_n' (x)\\
	 \vdots & \vdots & \ddots & \vdots \\
	 f_1^{(n-1)}(x)& f_2^{(n-1)}(x) & \cdots & f_n^{(n-1)}(x)
\end{array} \right |,\qquad x\in I
\end{equation}

*** Existence Theorem
    1) Claim: For all D.E. there exists a $y(t)$ that satisfies it
       locally on some interval

    2) Proof:
       	1) Let $y'=v \rightarrow v'=y''$
       	2) Therefore $v'=-py'-qy=-pv-qy$ , by plugging into the DE
       	3) In matrix form:
	   \begin{equation}
	   \left [
	   \begin{array}{c}
	   y\\v
	   \end{array} \right ]'=
	   \left [
	   \begin{array}{lr}
	   0 & 1\\
	   -q & -p
	   \end{array} \right ]
	   \left [
	   \begin{array}{c}
	   y\\v
	   \end{array} \right ]
	   \end{equation}
       	4) Note that this is a linear first order matrix system which there
	   is an existence therom for
*** Uniqueness
*** Second Order Linear Homogenous Diff Eq (S.O.L.H.D.E)
**** Form
     \begin{equation}
     a(x)\dd{y}{t} + b(x)\d{y}{t} + c(x)y=0
     \end{equation}
**** Theorm: The general solution to S.O.L.H.E
     Claim: The general soln of eq1$\equiv [y''+p(t)y'+g(t)y=0]$ is:
     \begin{equation}
     y_h=c_1y_1+c_2 y_2
     \end{equation}
**** Proof:
***** Q1: 
      Given y_1 and y_2 are solutions, why is $c_1y_1+c_2y_2$ a solution
	 1) $Eq1=D^2(y)+p(t)D(y)+q(t)y=0$
	 2) $Eq1=[D^2+p(t)D+q(t)]y=0$
	 3) Let $L=[D^2+p(t)D+q(t)]\rightarrow eq1\equiv L(y)=0$
	 4) Notice the L is a linear operator and thus obeys the
	    superposition principle
	 5) Thus $y = c_1 y_1 +c_2 y_2$ is a solution $\square$
***** Q2: 
      Given 2 indepent solutions y_1 and y_2 for the DE, $\forall$ IVP and its unique solution y, $\exists (c_1,c_2)
	 \in \mathbb{C}^2$ s.t. $y=c_1y_1 + c_2y_2 \equiv \vec{y}\cdot\vec{c}$
	 
******* Sub Proof of Q2
       	Consider IVP: $y''+py'+qy=0$
       	1) Take c_1 and c_2 s.t.:
	   \begin{equation}
	   \left [
	   \begin{array}{c}
	    a\\
	    b
	   \end{array}\right ]=
	   \left [
	   \begin{array}{cc}
	   y_1&y_2\\
	   y_1'&y_2'\\
	   \end{array} \right ]_{t=t_0}
	   \left [
	   \begin{array}{c}
	   c_1\\
	   c_2
	   \end{array} \right ]}
	   \end{equation}
       	2) Notice this is only solvable iff $W(y_1,y_2)_{t=t_0}\neq 0$
       	3) _Theorem_: If u and v solve $y'' + p(t)y' + g(t)y = 0$ then
	   W(u,v)=0 for all t or W is never 0
***** Q3:
****** Abel's Identity
       1. If u,v solve the D.E. then $W'+p(t)W=0 \rightarrow ce^{-\int p(t)dt}$
       2. Alternatively: $W' +p(t)W=0 \implies W'=0 \implies W=C$
****** Finding the general solution
      Goal: The general soln is of the form $y=\vec{y}\cdot\vec{c}$
      1) Recall the matrix form of the D.E. from the Existence theorem
	 proof.
      2) Also Recall that that the equation was only solvable if
	 $W(y_1,y_2)(t_0)\neq 0$
      3) Observe that $W'=(uv'+uv'')-(u'V+u'v') =-pW$
      4) _Lemma_: if u,v are linearly dependent, then $W(u,v)=0$ on I
**** Generating Second Solution
     1) Claim: if $y_1\neq 0$ be a solution to the D.E. then,
       	\begin{equation}
       	y_2 = Cy_1\int \frac{e^{-\int p dt}}{y_1^2}
       	\end{equation}
       	and y_2 = solution independent of y_1
     2) Proof:
       	1) Consider $(\frac{y_2}{y_1})' = \frac{y_1 y_2' - y_1'y_2}{y_1^2}=\frac{W(y_1,y_2)}{y_1^2}$
       	2) Given that $W'+p(t)W=0 \implies W(t)=ce^{-\int p(t) dt}$
       	3) Thus: $\int (\frac{y_2}{y_1})'dt = C \int \frac{e^{-\int p
	   dt}}{y_1^2}$
       	4) Solving: $y_2=Cy_1\int \frac{e^{-\int p
	   dt}}{y_1^2} \square$
*** Second Order Linear Inhomogenious Diff Eq (S.O.L.I.D.E)
**** Form
     \begin{equation}
     y^{(n)}(t)+p(t)y'(t)+q(t)y=f(t)
     \end{equation}
**** General Solution
      1. _Claim_: The general soln of $y^{(n)}(t)+p(t)y'(t)+q(t)y=f(t)$ is:
	 \begin{equation}
	 y=y_h+k(t)
	 \end{equation}
	 1. $y_h = c_1y_1+c_2y_2$ is the solution to the homogenous
	    equation i.e. $f(t)=0$
	 2. Functional Offset $(k(t))$: variation or 'offset' from the homogenous equation
      2. _Proof_:
	 1. Sub-Claim: $y_h+k$ is a solution
	    1. Using Operator notation: $D^2y+pDy+qy=f \implies [D^2+pD+q](y)=f$
	    2. Let $L\equivD^2+pD+q \implies L(y)=f$
	       1. Note that L is linear
	    3. $L(y_h+k) = L(y_h+k)=L(y_h)+L(y_p)$
	    4. $L(y_h)=0,L(y_p)=f \implies L(y_h+k)=f+0 = f \square$
	 2. Sub-Claim: $\forall y_i$, if $y_i$ is a solution to the
	    S.O.L.I.D.E, then $y_i=y_h+k$
	    1. $[L(y_i)=f$ and $L(k)=f] \implies L(y_i-k) = f-f=0$
	    2. By Existence of S.O.L.H.D.E, $L(y_i-k)=0 \implies$ $y_i-k=y_h$
	    3. Thus $y_i=k+y_h \square$
**** Exponential Shift Law
     \begin{equation}
     P(D)[e^{\alpha u(t)}]=p(D+\alpha)u(t)[e^{\alpha t}]
     \end{equation}
**** Expontial-Polynomial Functional offesets
***** Form
      \begin{equation}
      ay''+by'+cy=e^{\alpha t}g(t); \alpha\in\mathbb{C}
      \end{equation}
***** Characteristic Polynomial
      \begin{equation}
      p(r)=aD^2+bD+c
      \end{equation}
      Note that the DE in Operator notation is: $[aD^2+bD+c]$
***** Finding Particular Solution for S.O.L.E
      _Theorem_:
      - Let $k$ be s.t. $(r-\alpha)^k$ are roots of $p(\alpha)$
      - Then 
       	\begin{equation}
       	y_p=\frac{t^ke^{\alpha t}}{p^{(k)}(\alpha)}
       	\end{equation}
***** Method of Undetermined Coefficents
      _Idea_: if f(t) is a comprised of strict multiplications (no division) sinusoidal,exponetials, and
      polynomials then the solution of the S.O.L.E with const
      coefficents is in terms of of the same types you began with.

      _Cases_:
      
      if $f(t)=e^{\alpha t}$ (polynomial of $deg(k+m)$), then guess
      $y_p=e^{\alpha t}\Sigma_{j=0}^k C_jt^j$
