math441/notes.tex
\subsubsection{Uniqueness Theorm}
\label{sec-9.1.8}

\begin{enumerate}
\item \underline{Claim}:

\begin{enumerate}
\item If $\Phi(t)$ and $\Psi(t)$ are solutions of $y'\equiv
          f(y,t) \in R$ and if $f$ is Lipseitz w.r.t. $y\in R$
\item Then $\abs{\Phi(t) - Psi(t)} \leq e^{L\abs{t-t_0}}
          \abs{\Phi(t_0) - \Psi(t_0)} = 0$

\begin{enumerate}
\item Because they solve the same I.V.P. $\abs{\Phi(t_0) -
             \Psi(t_0)} = 0$
\end{enumerate}

\item Equivalently: Then $\Psi(t) = \Psi(t)$
\end{enumerate}

\item \underline{Proof}:

\begin{enumerate}
\item $E\equiv \abs{\Phi(t)-\Psi(t)}^2$

\begin{enumerate}
\item Note that $E\geq 0$
\end{enumerate}

\item $\d{}{t}E=2(\Phi(t)-\Psi(t))(\Phi'(t)-\Psi'(t))$
\item $E'\stackrel{DE}{=}2(\Phi(t)-\Psi(t))(f(t,\Phi)-f(t,\Psi))$
\item $E'\stackrel{Lip}{\leq} 2\abs{\Phi(t)-\Psi(t)}L\abs{\Phi(t)-\Psi(t)}$
\item Thus $E' \leq 2LE \implies E'-2LE \leq 0\implies (E(t) e^{-2Lt})' \leq 0$

\begin{enumerate}
\item Note that E' is stricly decreasing
\end{enumerate}

\item Therefore: $e^{-t}E(t)\leq e^{2Lt_0} E(t_0) \implies
          E(t)\leq e^{2L(t-t_0)}E(t_0)$
\item Substituting: $\abs{\Phi(t)-\Psi(t)}^2 \leq e^{2L(t-t_0)} \abs{\Phi(t_0)-\Psi(t_0)}^2$
\item Because of absolute value: $\abs{\Phi(t)-\Psi(t)} \leq e^{2L(t-t_0)} \abs{\Phi(t_0)-\Psi(t_0)}$
\item Because they solve the same I.V.P. $\abs{\Phi(t_0) -
          \Psi(t_0)} = 0$
\item Thus $\Phi(t)=\Psi(t) \square$
\end{enumerate}

\end{enumerate}
\subsection{Second Order Linear Eq}
\label{sec-9.2}

\subsubsection{The Wronskian:}
\label{sec-9.2.1}

\begin{equation}
W(f,g)(t) = \left |
\begin{array}{cccc}
         f_1(x) & f_2(x) & \cdots & f_n(x) \\
         f_1'(x) & f_2'(x) & \cdots & f_n' (x)\\
         \vdots & \vdots & \ddots & \vdots \\
         f_1^{(n-1)}(x)& f_2^{(n-1)}(x) & \cdots & f_n^{(n-1)}(x)
\end{array} \right |,\qquad x\in I
\end{equation}

\subsubsection{Existence Theorem}
\label{sec-9.2.2}

\begin{enumerate}
\item Claim: For all D.E. there exists a $y(t)$ that satisfies it
       locally on some interval
\item Proof:

\begin{enumerate}
\item Let $y'=v \rightarrow v'=y''$         2) Therefore $v'=-py'-qy=-pv-qy$ , by plugging into the DE
\item In matrix form:
           \begin{equation}
           \left [
           \begin{array}{c}
           y\\v
           \end{array} \right ]'=
           \left [
           \begin{array}{lr}
           0 & 1\\
           -q & -p
           \end{array} \right ]
           \left [
           \begin{array}{c}
           y\\v
           \end{array} \right ]
           \end{equation}
\item Note that this is a linear first order matrix system which there
           is an existence therom for
\end{enumerate}

\end{enumerate}
\subsubsection{Uniqueness}
\label{sec-9.2.3}

\subsubsection{Second Order Linear Homogenous Diff Eq (S.O.L.H.D.E)}
\label{sec-9.2.4}

\begin{itemize}

\item Form\\
\label{sec-9.2.4.1}

     \begin{equation}
     a(x)\dd{y}{t} + b(x)\d{y}{t} + c(x)y=0
     \end{equation}

\item Theorm: The general solution to S.O.L.H.E\\
\label{sec-9.2.4.2}

     Claim: The general soln of eq1$\equiv [y''+p(t)y'+g(t)y=0]$ is:
     \begin{equation}
     y_h=c_1y_1+c_2 y_2
     \end{equation}

\item Proof:\\
\label{sec-9.2.4.3}

\begin{itemize}

\item Q1:\\
\label{sec-9.2.4.3.1}

      Given y$_1$ and y$_2$ are solutions, why is $c_1y_1+c_2y_2$ a solution
\begin{enumerate}
\item $Eq1=D^2(y)+p(t)D(y)+q(t)y=0$
\item $Eq1=[D^2+p(t)D+q(t)]y=0$
\item Let $L=[D^2+p(t)D+q(t)]\rightarrow eq1\equiv L(y)=0$
\item Notice the L is a linear operator and thus obeys the
            superposition principle
\item Thus $y = c_1 y_1 +c_2 y_2$ is a solution $\square$
\end{enumerate}

\item Q2:\\
\label{sec-9.2.4.3.2}

      Given 2 indepent solutions y$_1$ and y$_2$ for the DE, $\forall$ IVP and its unique solution y, $\exists (c_1,c_2)
         \in \mathbb{C}^2$ s.t. $y=c_1y_1 + c_2y_2 \equiv \vec{y}\cdot\vec{c}$
         

\item Q3:\\
\label{sec-9.2.4.3.3}

\begin{itemize}

\item Abel's Identity\\
\label{sec-9.2.4.3.3.1}

\begin{enumerate}
\item If u,v solve the D.E. then $W'+p(t)W=0 \rightarrow ce^{-\int p(t)dt}$
\item Alternatively: $W' +p(t)W=0 \implies W'=0 \implies W=C$
\end{enumerate}

\item Finding the general solution\\
\label{sec-9.2.4.3.3.2}

      Goal: The general soln is of the form $y=\vec{y}\cdot\vec{c}$
\begin{enumerate}
\item Recall the matrix form of the D.E. from the Existence theorem
         proof.
\item Also Recall that that the equation was only solvable if
         $W(y_1,y_2)(t_0)\neq 0$
\item Observe that $W'=(uv'+uv'')-(u'V+u'v') =-pW$
\item \underline{Lemma}: if u,v are linearly dependent, then $W(u,v)=0$ on I
\end{enumerate}
\end{itemize} % ends low level
\end{itemize} % ends low level

\item Generating Second Solution\\
\label{sec-9.2.4.4}

\begin{enumerate}
\item Claim: if $y_1\neq 0$ be a solution to the D.E. then,
        \begin{equation}
        y_2 = Cy_1\int \frac{e^{-\int p dt}}{y_1^2}
        \end{equation}
        and y$_2$ = solution independent of y$_1$
\item Proof:

\begin{enumerate}
\item Consider $(\frac{y_2}{y_1})' = \frac{y_1 y_2' - y_1'y_2}{y_1^2}=\frac{W(y_1,y_2)}{y_1^2}$
\item Given that $W'+p(t)W=0 \implies W(t)=ce^{-\int p(t) dt}$
\item Thus: $\int (\frac{y_2}{y_1})'dt = C \int \frac{e^{-\int p
           dt}}{y_1^2}$
\item Solving: $y_2=Cy_1\int \frac{e^{-\int p
           dt}}{y_1^2} \square$
\end{enumerate}

\end{enumerate}
\end{itemize} % ends low level
\subsubsection{Second Order Linear Inhomogenious Diff Eq (S.O.L.I.D.E)}
\label{sec-9.2.5}

\begin{itemize}

\item Form\\
\label{sec-9.2.5.1}

     \begin{equation}
     y^{(n)}(t)+p(t)y'(t)+q(t)y=f(t)
     \end{equation}

\item General Solution\\
\label{sec-9.2.5.2}

\begin{enumerate}
\item \underline{Claim}: The general soln of $y^{(n)}(t)+p(t)y'(t)+q(t)y=f(t)$ is:
         \begin{equation}
         y=y_h+k(t)
         \end{equation}

\begin{enumerate}
\item $y_h = c_1y_1+c_2y_2$ is the solution to the homogenous
            equation i.e. $f(t)=0$
\item Functional Offset $(k(t))$: variation or `offset' from the homogenous equation
\end{enumerate}

\item \underline{Proof}:

\begin{enumerate}
\item Sub-Claim: $y_h+k$ is a solution

\begin{enumerate}
\item Using Operator notation: $D^2y+pDy+qy=f \implies [D^2+pD+q](y)=f$
\item Let $L\equivD^2+pD+q \implies L(y)=f$

\begin{enumerate}
\item Note that L is linear
\end{enumerate}

\item $L(y_h+k) = L(y_h+k)=L(y_h)+L(y_p)$
\item $L(y_h)=0,L(y_p)=f \implies L(y_h+k)=f+0 = f \square$
\end{enumerate}

\item Sub-Claim: $\forall y_i$, if $y_i$ is a solution to the
            S.O.L.I.D.E, then $y_i=y_h+k$

\begin{enumerate}
\item $[L(y_i)=f$ and $L(k)=f] \implies L(y_i-k) = f-f=0$
\item By Existence of S.O.L.H.D.E, $L(y_i-k)=0 \implies$ \$y$_i$-k=y$_h$\$
\item Thus $y_i=k+y_h \square$
\end{enumerate}

\end{enumerate}

\end{enumerate}

\item Exponential Shift Law\\
\label{sec-9.2.5.3}

     \begin{equation}
     P(D)[e^{\alpha u(t)}]=p(D+\alpha)u(t)[e^{\alpha t}]
     \end{equation}

\item Expontial-Polynomial Functional offesets\\
\label{sec-9.2.5.4}

\begin{itemize}

\item Form\\
\label{sec-9.2.5.4.1}

      \begin{equation}
      ay''+by'+cy=e^{\alpha t}g(t); \alpha\in\mathbb{C}
      \end{equation}

\item Characteristic Polynomial\\
\label{sec-9.2.5.4.2}

      \begin{equation}
      p(r)=aD^2+bD+c
      \end{equation}
      Note that the DE in Operator notation is: $[aD^2+bD+c]$

\item Finding Particular Solution for S.O.L.E\\
\label{sec-9.2.5.4.3}

      \underline{Theorem}:
\begin{itemize}
\item Let $k$ be s.t. $(r-\alpha)^k$ are roots of $p(\alpha)$
\item Then 
        \begin{equation}
        y_p=\frac{t^ke^{\alpha t}}{p^{(k)}(\alpha)}
        \end{equation}
\end{itemize}

\item Method of Undetermined Coefficents\\
\label{sec-9.2.5.4.4}

      \underline{Idea}: if f(t) is a comprised of strict multiplications (no division) sinusoidal,exponetials, and
      polynomials then the solution of the S.O.L.E with const
      coefficents is in terms of of the same types you began with.

      \underline{Cases}:
      
      if $f(t)=e^{\alpha t}$ (polynomial of $deg(k+m)$), then guess
      $y_p=e^{\alpha t}\Sigma_{j=0}^k C_jt^j$
\end{itemize} % ends low level
