math441/notes.org
**** Annihilator Method
     1. Given: $(D^2+aD+b)y=e^{\alpha t}f(t)$, where $f(t)$ is a polynomial
     2. Attempt to multiply both sides by a Differential Operator ($G$) s.t.
	\begin{equation}
	G(e^{\alpha t}f(t)) = 0 \implies G(D^2+aD+b)y=0
	\end{equation}
     3. Notice that this is now a homogenous equation. Solve by
        finding the roots of the characteristic equation and applying
        the method of undetermined coefficents
**** Lagrange Variation of Parameters
***** Equation:
      \begin{equation}
      y_p=\int{\frac{y_1f(x)}{W(y_1,y_2)}dt}+\int{\frac{y_2f(x)}{W(y_1,y_2)}dt}
      \end{equation}
***** Derivation:
      See General Derivation
*** Foulrier Transform
*** Strum Comparison Theorem
    _Theorem_: 
    1. If:
       1. $u''+q_1(t)u=0$ and $v''+q_2v =0$
       2. $q_1>q_2$
    2. Then:
       1. $u$ vanishes as some point between $2$ zeros of $v$
** General Linear Diff Eq and Variation of Parameters
*** Form
    \begin{equation}
    y^{(n)}(x)+\sum_{k=0}^na_k(x)y^{(k)}(x)=f(x)
    \end{equation}
*** Equation:
    \begin{equation}
    \sum_{k=0}^n[y_k(x)\int{\frac{W_k(x)}{W(X)}dx}]
    \end{equation}
    $W(x)\equiv$ Wronskian determinant of the fundamental system
    and $W_i(x)\equiv$ the Wronskian determinant of the fundamental system
    with the $i-th$ column replaced by $(0,0,\ldots,f(x))$   
**** Derivation:

*** Theorem for L.D.E
    If $u(t)+iv(t)$ is a solution to the D.E. then $u(t) \wedge v(t)$
    are solutions

* First Order Systems of Linear Diff Equations with Const Coefficents
** Form
   \begin{equation}
   \vec{r}' = A\vec{r}
   \end{equation}
*** Example 1st Order
    \begin{equation}
    \vec{r}' = \left [
    \begin{array}{c}
    x' \\
    y'
    \end{array} \right ] = \left [
    \begin{array}{c}
    ax+by\\
    cx+dy
    \end{array} \right ] = \left [
    \begin{array}{cc}
    a & b\\
    c & d\\
    \end{array} \right ] \left [
    \begin{array}{c}
    x\\
    y\\
    \end{array} \right ]
    \end{equation}
** Solution
   1. Guess: $\vec{r} = \vec{a} e^{\lambda t}$, $\vec{a} \in D$
   2. Thus $\vec{r}' = \lamda \vec{a} e^{\lambda t} \implies \lambda
      \vec{a} = A \vec{a}$
   3. Factoring we get $(A-\lambda I)\vec{a} = \vec{0}$
   4. _Characteristic Polynomial_ $\equiv \abs{A-\lambda I}$
      1. For the 2-d version we get
	 \begin{equation}
	 \abs{A-\lambda I} = \lambda^2 + tr(A) + |A|
	 \end{equation}
   5. Solve for Eigen Value and Corresponding Eigen Vectors
      1. _Complete e-value_: K-Repeated Eigen value produces K linearly
	 independent eigen vectors
      2. _Incomplete e-value_: Does not produce enough
	 e-values. Solution: assume solution is:
	 \begin{equation}
	 \vec{r} = u(t)\vec{a}e^{\lambda t} + \vec{c}
	 \end{equation}
	 1. Typically $u(t)$ is a polynomial as in the $D$-1 case

** Classification
   Let $p\equiv tr(A)$ and $q\equiv |A|$

*** Theorem: Change of coordinates
    1. _Claim_: $\vec{x}' = A\vec{x} \equiv \vec{y}' = B\vec{y}
       \iff |A-\lamba I| = |B-\lamba I|$ and $(tr[A])^2 -4|A|
       \neq 0$
       1. $(tr[A])^2 -4|A| \neq 0$ excludes repeated roots
    2. _Alternate version_: $\exists$ non-singular matrix $U$ s.t. $\vec{y}=U\vec{x}$ and $B = UAU^{-1}$
       1. This is a change of cordinates
    3. _Light Proof_: Suppose $\vec{x}' = A\vec{x} \equiv \vec{y}' = B\vec{y}'$
       1. By the claim $|B-\lambda I| = |UAU^{-1} - \lambda I|$
       2. Note that $\lambda I = \lambda U U^{-1} = U\lambda I U^{-1} \implies |B -
          \lambda I| = |UAU^{-1} - U(\lambda I)U^{-1} |$
       3. Factoring $|U(A-\lambda I)U^{-1}| = |U| |A-\lambda I||U^{-1}$
       4. Using the communitive property of
          multiplication: $|U||U^{-1}||A-\lambda I| = |A-\lambda I|$
       5. Thus: $|B - \lambda I| = |A - \lambda I|$
