math441/notes.tex

\item Annihilator Method\\
\label{sec-9.2.5.5}

\begin{enumerate}
\item Given: $(D^2+aD+b)y=e^{\alpha t}f(t)$, where $f(t)$ is a polynomial
\item Attempt to multiply both sides by a Differential Operator ($G$) s.t.
        \begin{equation}
        G(e^{\alpha t}f(t)) = 0 \implies G(D^2+aD+b)y=0
        \end{equation}
\item Notice that this is now a homogenous equation. Solve by
        finding the roots of the characteristic equation and applying
        the method of undetermined coefficents
\end{enumerate}

\item Lagrange Variation of Parameters\\
\label{sec-9.2.5.6}

\begin{itemize}

\item Equation:\\
\label{sec-9.2.5.6.1}

      \begin{equation}
      y_p=\int{\frac{y_1f(x)}{W(y_1,y_2)}dt}+\int{\frac{y_2f(x)}{W(y_1,y_2)}dt}
      \end{equation}

\item Derivation:\\
\label{sec-9.2.5.6.2}

      See General Derivation
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsubsection{Foulrier Transform}
\label{sec-9.2.6}

\subsubsection{Strum Comparison Theorem}
\label{sec-9.2.7}

    \underline{Theorem}: 
\begin{enumerate}
\item If:

\begin{enumerate}
\item $u''+q_1(t)u=0$ and $v''+q_2v =0$
\item $q_1>q_2$
\end{enumerate}

\item Then:

\begin{enumerate}
\item $u$ vanishes as some point between $2$ zeros of $v$
\end{enumerate}

\end{enumerate}
\subsection{General Linear Diff Eq and Variation of Parameters}
\label{sec-9.3}

\subsubsection{Form}
\label{sec-9.3.1}

    \begin{equation}
    y^{(n)}(x)+\sum_{k=0}^na_k(x)y^{(k)}(x)=f(x)
    \end{equation}
\subsubsection{Equation:}
\label{sec-9.3.2}

    \begin{equation}
    \sum_{k=0}^n[y_k(x)\int{\frac{W_k(x)}{W(X)}dx}]
    \end{equation}
    $W(x)\equiv$ Wronskian determinant of the fundamental system
    and $W_i(x)\equiv$ the Wronskian determinant of the fundamental system
    with the $i-th$ column replaced by $(0,0,\ldots,f(x))$   
\begin{itemize}

\item Derivation:\\
\label{sec-9.3.2.1}


\end{itemize} % ends low level
\subsubsection{Theorem for L.D.E}
\label{sec-9.3.3}

    If $u(t)+iv(t)$ is a solution to the D.E. then $u(t) \wedge v(t)$
    are solutions

\section{First Order Systems of Linear Diff Equations with Const Coefficents}
\label{sec-10}

\subsection{Form}
\label{sec-10.1}

   \begin{equation}
   \vec{r}' = A\vec{r}
   \end{equation}
\subsubsection{Example 1st Order}
\label{sec-10.1.1}

    \begin{equation}
    \vec{r}' = \left [
    \begin{array}{c}
    x' \\
    y'
    \end{array} \right ] = \left [
    \begin{array}{c}
    ax+by\\
    cx+dy
    \end{array} \right ] = \left [
    \begin{array}{cc}
    a & b\\
    c & d\\
    \end{array} \right ] \left [
    \begin{array}{c}
    x\\
    y\\
    \end{array} \right ]
    \end{equation}
\subsection{Solution}
\label{sec-10.2}

\begin{enumerate}
\item Guess: $\vec{r} = \vec{a} e^{\lambda t}$, $\vec{a} \in D$
\item Thus $\vec{r}' = \lamda \vec{a} e^{\lambda t} \implies \lambda
      \vec{a} = A \vec{a}$
\item Factoring we get $(A-\lambda I)\vec{a} = \vec{0}$
\item \underline{Characteristic Polynomial} $\equiv \abs{A-\lambda I}$

\begin{enumerate}
\item For the 2-d version we get
         \begin{equation}
         \abs{A-\lambda I} = \lambda^2 + tr(A) + |A|
         \end{equation}
\end{enumerate}

\item Solve for Eigen Value and Corresponding Eigen Vectors

\begin{enumerate}
\item \underline{Complete e-value}: K-Repeated Eigen value produces K linearly
         independent eigen vectors
\item \underline{Incomplete e-value}: Does not produce enough
         e-values. Solution: assume solution is:
         \begin{equation}
         \vec{r} = u(t)\vec{a}e^{\lambda t} + \vec{c}
         \end{equation}

\begin{enumerate}
\item Typically $u(t)$ is a polynomial as in the $D$-1 case
\end{enumerate}

\end{enumerate}

\end{enumerate}
\subsection{Classification}
\label{sec-10.3}

   Let $p\equiv tr(A)$ and $q\equiv |A|$

\subsubsection{Theorem: Change of coordinates}
\label{sec-10.3.1}

    1. \underline{Claim}: $\vec{x}' = A\vec{x} \equiv \vec{y}' = B\vec{y}
       \iff |A-\lamba I| = |B-\lamba I|$ and $(tr[A])^2 -4|A|
       \neq 0$
\begin{enumerate}
\item $(tr[A])^2 -4|A| \neq 0$ excludes repeated roots
\item \underline{Alternate version}: $\exists$ non-singular matrix $U$ s.t. $\vec{y}=U\vec{x}$ and $B = UAU^{-1}$

\begin{enumerate}
\item This is a change of cordinates
\end{enumerate}

\item \underline{Light Proof}: Suppose $\vec{x}' = A\vec{x} \equiv \vec{y}' = B\vec{y}'$

\begin{enumerate}
\item By the claim $|B-\lambda I| = |UAU^{-1} - \lambda I|$
\item Note that $\lambda I = \lambda U U^{-1} = U\lambda I U^{-1} \implies |B -
          \lambda I| = |UAU^{-1} - U(\lambda I)U^{-1} |$
\item Factoring $|U(A-\lambda I)U^{-1}| = |U| |A-\lambda I||U^{-1}$
\item Using the communitive property of
          multiplication: $|U||U^{-1}||A-\lambda I| = |A-\lambda I|$
\item Thus: $|B - \lambda I| = |A - \lambda I|$
\end{enumerate}

\end{enumerate}

\end{document}